In [1]:
import pandas as pd
import numpy as np

# SERIES - 1dim array of labeled data

In [2]:
pd.Series(['A', 'B', 'C'])

0    A
1    B
2    C
dtype: object

# DATAFRAME  - 2D array of labeled data

In [3]:
df = pd.DataFrame({
    "Name" : ["Olga", "Anna", "Alex"],
    "Color" : ["Red", "Blue", "Green"],
    "Random" : [10.0, np.nan, np.nan]
})

In [4]:
df

   Name  Color  Random
0  Olga    Red    10.0
1  Anna   Blue     NaN
2  Alex  Green     NaN

In [5]:
df["Random"] #returns series

0    10.0
1     NaN
2     NaN
Name: Random, dtype: float64

In [6]:
#CSV file - comma separated values
df.to_csv('data.csv', index=False)

### Exercise 1

In [7]:
fruits = pd.Series([20, 30, 15, 10], index = ['Apples', 'Bananas', 'Cherries', 'Dates'])

In [8]:
fruits

Apples      20
Bananas     30
Cherries    15
Dates       10
dtype: int64

In [9]:
fruit_names = ['Apples', 'Bananas', 'Cherries', 'Dates']
quantities = [20, 30, 15, 10]
colors = ['red', 'yellow', 'red', 'brown']
price = [3,2,4,5]
fruits_df = pd.DataFrame({ 
    'quantity' : quantities,
    'color' : colors,
    'price_kg' : price },
    index = fruit_names )

In [10]:
fruits_df.to_csv('fruits_data.csv')

In [11]:
df = pd.read_csv('data.csv', index_col=0)

In [12]:
df.head() #first 5 rows by default .head(state how many first)

      Color  Random
Name
Olga    Red    10.0
Anna   Blue     NaN
Alex  Green     NaN

In [13]:
df.tail(2) #the last rows

      Color  Random
Name
Anna   Blue     NaN
Alex  Green     NaN

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Olga to Alex
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Color   3 non-null      object
 1   Random  1 non-null      float64
dtypes: float64(1), object(1)
memory usage: 72.0+ bytes

In [15]:
df2 = pd.read_csv('fruits_data.csv', index_col=0)

In [16]:
df2.describe()

        quantity  price_kg
count   4.000000  4.000000
mean   18.750000  3.500000
std     8.539126  1.290994
min    10.000000  2.000000
25%    13.750000  2.750000
50%    17.500000  3.500000
75%    22.500000  4.250000
max    30.000000  5.000000

# INDEXING

In [17]:
#LOC - selecting row by index value

In [18]:
df2.loc['Dates']

quantity       10
color       brown
price_kg        5
Name: Dates, dtype: object

In [19]:
#iLOC - selecting row by numerical index
df2.iloc[0]

quantity     20
color       red
price_kg      3
Name: Apples, dtype: object

In [20]:
#SLICING

df2[0:3]

          quantity   color  price_kg
Apples          20     red         3
Bananas         30  yellow         2
Cherries        15     red         4

In [21]:
df2[0:3]['price_kg']

Apples      3
Bananas     2
Cherries    4
Name: price_kg, dtype: int64

In [22]:
df2[0:3][['price_kg', 'color']]

          price_kg   color
Apples           3     red
Bananas          2  yellow
Cherries         4     red

# Adding, Renaming, Removing

In [23]:
df2['Country'] = ['USA', 'Israel', 'Germany', 'UK'] #add a column

In [24]:
df2

          quantity   color  price_kg  Country
Apples          20     red         3      USA
Bananas         30  yellow         2   Israel
Cherries        15     red         4  Germany
Dates           10   brown         5       UK

In [25]:
df2.rename(columns={'price_kg' : 'Price'}, inplace = True) #rename smth

In [26]:
df2

          quantity   color  Price  Country
Apples          20     red      3      USA
Bananas         30  yellow      2   Israel
Cherries        15     red      4  Germany
Dates           10   brown      5       UK

In [27]:
df2.drop('Country', axis = 1)

          quantity   color  Price
Apples          20     red      3
Bananas         30  yellow      2
Cherries        15     red      4
Dates           10   brown      5

In [28]:
df2.drop('Country', axis = 1, inplace = True) #to REALLY REMOVE

# CHANGING DATA

In [29]:
df2['quantity'] * 2 #all values multiplied by 2

Apples      40
Bananas     60
Cherries    30
Dates       20
Name: quantity, dtype: int64

In [30]:
df2['quantity'] = df2['quantity'] * 2

In [31]:
df2

          quantity   color  Price
Apples          40     red      3
Bananas         60  yellow      2
Cherries        30     red      4
Dates           20   brown      5

# NAN Values

In [32]:
df2.isna()

          quantity  color  Price
Apples       False  False  False
Bananas      False  False  False
Cherries     False  False  False
Dates        False  False  False

In [33]:
df2.iloc['color'][0]

TypeError: Cannot index by location index with a non-integer key

In [ ]:
df2.iloc[0]['color'] =

# Change the data type in column

In [ ]:
df2['quantity'] = df2['quantity'].astype('float16')

# STATISTICS

In [ ]:
df2.mean

In [ ]:
df2.max

In [ ]:
df2.min

### Exercise 2

In [ ]:
df3 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 32, 22, 35, 47],
    "Score": [85, 63, 77, 96, 54]
})

In [42]:
df2['quantity'].sum()

150

In [43]:
df2.nlargest(3, 'quantity')

          quantity  Original_Price  Sale_Price
Bananas         60               2         1.8
Apples          40               3         2.7
Cherries        30               4         3.6

In [44]:
df2.loc['Bananas']

quantity          60.0
Original_Price     2.0
Sale_Price         1.8
Name: Bananas, dtype: float64

In [45]:
df2.loc['Bananas']['quantity']

60.0

In [36]:
df2['Sale_Price'] = df2['Price'] * 0.9

In [37]:
df2

          quantity  Price  Sale_Price
Apples          40      3         2.7
Bananas         60      2         1.8
Cherries        30      4         3.6
Dates           20      5         4.5

In [38]:
df2.rename(columns={'Price' : 'Original_Price'}, inplace = True)

In [39]:
df2

          quantity  Original_Price  Sale_Price
Apples          40               3         2.7
Bananas         60               2         1.8
Cherries        30               4         3.6
Dates           20               5         4.5

In [40]:
df2.drop('color', axis = 1, inplace = True)

KeyError: "['color'] not found in axis"

In [41]:
df2

          quantity  Original_Price  Sale_Price
Apples          40               3         2.7
Bananas         60               2         1.8
Cherries        30               4         3.6
Dates           20               5         4.5

In [54]:
new_data = pd.DataFrame({"Fruit": ["Grapes"], "quantity": [np.nan], "Original_price": [3.5], "Sale_price": [3.5 *0.9]}, )

In [55]:
new_data.set_index('Fruit', inplace = True)

In [56]:
new_data

        quantity  Original_price  Sale_price
Fruit
Grapes       NaN             3.5        3.15

In [57]:
df_with_index = pd.concat([df2, new_data])

In [58]:
df_with_index

          quantity  Original_Price  Sale_Price  Original_price  Sale_price
Apples        40.0             3.0         2.7             NaN         NaN
Bananas       60.0             2.0         1.8             NaN         NaN
Cherries      30.0             4.0         3.6             NaN         NaN
Dates         20.0             5.0         4.5             NaN         NaN
Grapes         NaN             NaN         NaN             3.5        3.15

In [60]:
df2['quantity'].dtype

dtype('int64')

In [61]:
df2['quantity'].astype('float16')

Apples      40.0
Bananas     60.0
Cherries    30.0
Dates       20.0
Name: quantity, dtype: float16

In [62]:
df2.nlargest(1, 'quantity')

         quantity  Original_Price  Sale_Price
Bananas        60               2         1.8

In [63]:
df2['quantity'].idxmax() #returns the index of the item with the highest

'Bananas'

In [64]:
df2['quantity'].idxmin()  #returns the index of the item with the lowest

'Dates'

# DATA MANIPULATION

In [65]:
dframe = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [10, 20, 30, 40],
    'C': [100, 200, 300, 400]
})

In [66]:
#apply functions on column or a row
dframe['C'].apply(np.sqrt) #square root

0    10.000000
1    14.142136
2    17.320508
3    20.000000
Name: C, dtype: float64

In [67]:
def mult_by_3(n):
    return n * 3

In [68]:
dframe['A'].apply(mult_by_3)

0     3
1     6
2     9
3    12
Name: A, dtype: int64

In [69]:
dframe[['A', 'B']].apply(mult_by_3)

    A    B
0   3   30
1   6   60
2   9   90
3  12  120

In [70]:
#MAP - changes one original value to smth else
mapping = {1: 'ONE', 2: 'TWO', 3: 'THREE', 4: 'FOUR'}
dframe['A'].map(mapping)

0      ONE
1      TWO
2    THREE
3     FOUR
Name: A, dtype: object

In [71]:
dframe.applymap(mult_by_3) #applies a function on all of dataframe

    A    B     C
0   3   30   300
1   6   60   600
2   9   90   900
3  12  120  1200

In [72]:
dframe.groupby('A').mean() #group by smth repetative, used with aggregate function

      B      C
A
1  10.0  100.0
2  20.0  200.0
3  30.0  300.0
4  40.0  400.0

In [ ]:
pd.concat([df1, df2]) #to connect two dataframes

In [ ]:
#Merging

dframe = pd.merge(df3, df4, on = 'smth') #merges based on something

In [ ]:
#SORTING

In [73]:
dframe.sort_values(by = "A")

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [ ]:
chipo = pd.read_csv('link', sep = '\t')